data = read("D:\AAAULTIMATELABA3\data\kf\log3.txt",-1,3);   //чтение эксперимента


function e = G(a,z),   //функция для расчета амплитуды напряжения и частоты синусоиды МНК
    e = z(2) - (a(1) * sin(a(2)* z(3)));
endfunction

a0 = [1; 1];
amin = [1; 1];
amax = [10; 10]
//[aa, error1] = datafit(G, data','b', amin, amax, a0)   // расчет амплитуды напряжения и частоты синусоиды
aa=[8.0538396/4 ; 1]

//проверка аппроксимации построением графика
disp(aa)
t(:,1) = 0:0.01:20
t(:,2) = aa(1) * sin(aa(2) * t(:,1)) 
plot(data(:,3), data(:,2))
plot(t(:,1), t(:,2), "r-.")
